import React from "react";
import { Layout, Menu } from 'antd';
import logo from '../images/Plan.png';

const { SubMenu } = Menu;
const { Content } = Layout;


export const App = () => {

    return (
        <Layout className='content'>
            <Content className='myeduc'>
                <div class="d-flex justify-content-center flex-wrap">
                    <div class="d-flex flex-column bd-highlight mb-3" style={{ textAlign: 'center' }}>
                        <div class="p-2 bd-highlight">
                            <b style={{ fontSize: '32px' }}>САМООСВІТА</b>
                        </div>
                        <div class="p-2 bd-highlight">
                            <b style={{ fontSize: '24px', fontStyle: 'italic' }}>«Формування та розвиток навчально-пізнавальних компетентностей учнів на уроках математики»</b>
                        </div>
                    </div>
                </div>
                <div class="d-flex flex-column bd-highlight mb-3" style={{ fontSize: '18px' }}>
                    <div class="p-2 bd-highlight">
                        <b>Цілі:</b><br />
                        <span>
                            • розвиток індивідуальності учнів;<br />
                        • виявлення і розвиток здібностей кожного учня;<br />
                        • формування позитивної мотивації навчання у школярів;<br />
                        • викорінювання неуспішних;<br />
                        • підвищення свого методичного рівня;<br />
                        • отримання міцних і глибоких знань учнями;<br />
                        </span>
                        <br />

                        <b>Завдання:</b><br />
                        <span>
                            • Продовжити роботу над підвищенням науково-теоретичного рівня в області теорії і методики викладання математики;<br />
                        • Розробити методичні рекомендації, дидактичні матеріали у рамках інновації, що реалізовується;<br />
                        • Вивчити психологічні і вікові особливості школярів.<br />
                        </span>
                        <br />

                        <b>Основні напрями самоосвіти:</b><br />
                        <span>
                            • Професійне (предмет викладання) і методичне (педагогічні технології, форми, методи і прийоми навчання, інформаційно-комп’ютерні технології)<br />
                        • Психолого-педагогічне (орієнтоване на учнів і батьків)<br />
                        • Охорона здоров’я<br />
                        • Психологічне (імідж, спілкування, мистецтво впливу, лідерські якості та ін.)<br />
                        • Правове<br />
                        • Естетичне (гуманітарне)<br />
                        Джерела самоосвіти : спеціалізована література (методична, науково-популярна, публіцистична, художня), Інтернет; медіа-інформація на різних носіях, семінари, конференції,
                        лекторії, заходи по обміну досвідом, курси підвищення кваліфікації.<br />
                        Форми самоосвіти : Індивідуальна – через індивідуальний план, групова – через участь в діяльності шкільного і міського методичних об’єднань учителів
                        математики, а також через участь в житті школи.<br />
                        </span>
                        <br />

                        <b>Очікуваний результат самоосвіти :</b><br />
                        <span>
                            • підвищення якості викладання предмета;<br />
                        • розробка сценаріїв позакласних заходів із застосуванням ІКТ;<br />
                        • розробка і апробація дидактичних матеріалів, тестів, наглядностей, створення електронних комплектів педагогічних розробок;<br />
                        • вироблення методичних рекомендацій по застосуванню нової інформаційної технології на уроках математики;<br />
                        • розробка і проведення відкритих уроків;<br />
                        • узагальнення досвіду по досліджуваній темі;<br />
                        • доповіді, виступи на засіданнях МО.<br />
                        </span>
                        <br />

                        <b>Заплановані результати самореалізації:</b><br />
                        <span>
                            • Розробка комплекту електронних уроків по математиці<br />
                        • Розробка пакету матеріалу в електронному вигляді, у тому числі:<br />
                            <div style={{ marginLeft: '20px' }}>
                                - комплекту дидактики по предмету (самостійні, практичні і контрольні роботи); <br />
                                - комплекту роздавального матеріалу по предмету (картки, завдання і питання по предмету);<br />
                                - збірки предметних кросвордів <br />
                                - пакету олімпіадного матеріалу для підготовки учня<br />
                                - пакету адміністративної документації методичного предметного об’єднання <br />
                                - бази цих методик навчання<br />
                                - пакет сценаріїв уроків із застосуванням інформаційних технологій <br />
                                - пакет бланків і зразків документів для педагогічної діяльності (різні грамоти, анкети, плани і так далі)<br />
                                - комплекту тематичного класного годинника, батьківських зборів або позакласних предметних заходів (пізнавальні ігри, конкурси)<br />
                            </div>
                        </span>
                    </div>
                    <div class="p-2 bd-highlight" style={{ textAlign: 'center' }}>
                        <b style={{ fontSize: '20px' }}>ПЛАН</b> <br />
                        <img src={logo} alt='photo' id='plan'></img>
                    </div>
                    <br />
                    <div class="p-2 bd-highlight">
                        <b>Для реалізації особово-орієнтованого уроку вимагається враховувати підходи:</b><br />
                        <span>
                            • виклад учбового матеріалу має бути спрямований на інтеграцію його змісту, встановлення міжпредметних зв’язків, збагачення особистого досвіду кожного учня;<br />
                        • учбовий матеріал повинен давати можливість вибору при виконанні завдань і рішенні завдань;<br />
                        • стимулювання самостійного вибору і використання значимих способів освоєння учбового матеріалу.<br />
                        </span>
                        <br />

                        <b>Організація уроків включає такі моменти як:</b><br />
                        <span>
                            • облік особових особливостей учнів;<br />
                        • застосування прийомів для актуалізації і збагачення суб’єктного досвіду дитини;<br />
                        • використання різноманітних форм спілкування;<br />
                        • створення довіри і толерантності в учбових взаємодіях;<br />
                        • стимулювання учнів до вибору учбових завдань, форм і способів їх виконання;<br />
                        • використання учнями таких мовних зворотів, як: “я вважаю, що”., “мені здається, що”., “на мою думку”, “я думаю, що”. і т. д.<br />
                        </span>
                        <br />
                    </div>
                </div>
            </Content>
        </Layout>
    );
};

export default App;