import React from "react";
import { Layout, Menu } from 'antd';

const { SubMenu } = Menu;
const { Content } = Layout;


export const App = () => {

    return (
        <Layout className='content'>
            <Content className='znodpa'>
                <div class="d-flex flex-column bd-highlight mb-3" style={{ fontSize: '18px' }}>
                    <div class="p-2 bd-highlight">
                        <span style={{ marginLeft: '20px' }}>
                            Тест зовнішнього незалежного оцінювання з математики у {new Date().getFullYear()} році складається із завдань чотирьох форм: завдань з вибором однієї правильної відповіді,
                            завдань на встановлення відповідності, завдань відкритої форми з короткою відповіддю (структуроване та неструктуроване), а також завдань відкритої
                            форми з розгорнутою відповіддю.<br />
                            &nbsp;&nbsp;&nbsp;&nbsp; Загальна кількість завдань тесту з математики – <b>33</b>, на виконання яких учасникам буде відведено <b>180</b> хвилин.
                        </span>
                        <br /><br />

                        <span style={{ marginLeft: '20px' }}>
                            Результат виконання завдань №1-28 та №31-32 за вибором випускника може бути зараховуваний як
                            <span style={{ textDecorationLine: 'underline' }}> державна підсумкова атестація</span> з математики.
                            Результат виконання завдань всього тесту буде використовуватися під час прийому до
                            <span style={{ textDecorationLine: 'underline' }}> вищих навчальних закладів України.</span><br />
                            &nbsp;&nbsp;&nbsp;&nbsp;Максимальна кількість тестових балів, яку може отримати учасник ЗНО, правильно виконавши всі завдання №1-28, №31-32, що будуть зараховуватися
                            як державна підсумкова атестація, дорівнює <b>52</b> балам.<br />
                            &nbsp;&nbsp;&nbsp;&nbsp;Максимальна кількість тестових балів яку можна набрати правильно виконавши всі завдання тесту - <b>62</b> бала.
                        </span>
                        <br />
                    </div>
                    <div class="p-2 bd-highlight" style={{ textAlign: 'center' }}>
                        <a href="https://zno.osvita.ua/mathematics/" class="btn btn-primary btn-lg" tabindex="-1" role="button" aria-disabled="true" target='_blank'>Пройти тести ЗНО онлайн з математики</a>
                    </div>
                    <br />
                    <b>ФОРМИ ТЕСТОВИХ ЗАВДАНЬ</b>
                    <div class="p-2 bd-highlight">
                        <span style={{ marginLeft: '20px' }}>
                            <b>Завдання з вибором однієї правильної відповіді (№ 1–20) </b>
                        — завдання складається з основи та п’яти варіантів відповіді, з яких лише один правильний. Завдання вважається виконаним, якщо учасник зовнішнього
                        незалежного оцінювання вибрав і позначив відповідь у бланку відповідей А.<br />
                        &nbsp;&nbsp;&nbsp;&nbsp;Завдання з вибором однієї правильної відповіді оцінюється в 0 або 1 бал: 1 бал, якщо вказано правильну відповідь; 0 балів, якщо вказано неправильну
                        відповідь, або вказано більше однієї відповіді, або відповіді на завдання не надано.<br />

                        &nbsp;&nbsp;&nbsp;&nbsp;<b>Завдання на встановлення відповідності («логічні пари») (№ 21–24)</b>
                        — завдання складається з основи та двох стовпчиків інформації, позначених цифрами (ліворуч) і буквами (праворуч). Виконання завдання передбачає
                        встановлення відповідності (утворення «логічних пар») між інформацією, позначеною цифрами та буквами. Завдання вважається виконаним, якщо учасник
                        зовнішнього незалежного оцінювання зробив позначки на перетинах рядків (цифри від 1 до 4) і колонок (букви від А до Д) у таблиці бланка відповідей А.<br />
                        &nbsp;&nbsp;&nbsp;&nbsp;Завдання на встановлення відповідності («логічні пари») оцінюється в 0, 1, 2, 3 або 4 бали: 1 бал – за кожну правильно встановлену відповідність
                        («логічну пару»); 0балів за будь-яку «логічну пару», якщо зроблено більше однієї позначки в рядку; 0 балів за завдання, якщо не вказано жодної
                        правильної відповідності («логічної пари»), або відповіді на завдання не надано.<br />

                        &nbsp;&nbsp;&nbsp;&nbsp;<b>Структуроване завдання відкритої форми з короткою відповіддю (№ 25, 26)</b>
                        — завдання складається з основи та двох частин і передбачає розв’язування задачі. Завдання вважається виконаним, якщо учасник зовнішнього незалежного оцінювання, здійснивши відповідні числові розрахунки, записав, дотримуючись вимог і правил, відповіді до кожної з частин завдання в бланку відповідей А.<br />
                        &nbsp;&nbsp;&nbsp;&nbsp;Структуроване завдання оцінюється в 0, 1 або 2 бали: 1 бал за кожну правильно вказану відповідь; 0 балів, якщо вказано обидві неправильні відповіді, або відповіді на завдання не надано;<br />

                        &nbsp;&nbsp;&nbsp;&nbsp;<b>Неструктуроване завдання відкритої форми з короткою відповіддю (№ 27–30)</b>
                        — завдання складається з основи та передбачає розв’язування задачі. Завдання вважається виконаним, якщо учасник зовнішнього незалежного оцінювання, здійснивши відповідні числові розрахунки, записав, дотримуючись вимог і правил, кінцеву відповідь у бланку відповідей А.<br />
                        &nbsp;&nbsp;&nbsp;&nbsp;Неструктуроване завдання оцінюється в 0 або 2 бали: 2 бали, якщо вказано правильну відповідь; 0 балів, якщо вказано неправильну відповідь, або відповіді на завдання не надано.<br />

                        &nbsp;&nbsp;&nbsp;&nbsp;<b>Завдання відкритої форми з розгорнутою відповіддю (№ 31–33)</b>
                        — завдання складається з основи та передбачає розв’язування задачі. Завдання вважається виконаним, якщо учасник зовнішнього незалежного оцінювання в бланку відповідей Б навів пояснення всіх етапів розв’язання, зробив посилання на математичні факти, з яких випливає те чи інше твердження, проілюстрував розв’язання задачі рисунками, графіками тощо.<br />
                        &nbsp;&nbsp;&nbsp;&nbsp;Завдання відкритої форми з розгорнутою відповіддю № 31, 32 оцінюються в 0, 1, 2, 3 або 4 бали; № 33 оцінюється в 0, 1, 2, 3, 4, 5 або 6 балів.<br />
                        &nbsp;&nbsp;&nbsp;&nbsp;Розв’язання завдань у чернетці не перевіряються і до уваги не беруться.
                        </span>
                        <br /><br />

                        <span style={{ marginLeft: '20px' }}>
                            При підготовці до тестування зверніть увагу на програму зовнішнього незалежного оцінювання з математики, відповідно до якої розроблено зміст тесту. Завдання ЗНО з математики полягає у тому, щоб оцінити знання та вміння учасників тестування:<br />
                        - будувати математичні моделі реальних об'єктів, процесів i явищ та досліджувати ці моделі засобами математики;<br />
                        - виконувати математичні розрахунки (виконувати дії з числами, поданими в різних формах, дії з відсотками, складати та розв'язувати задачі на пропорції, наближені обчислення тощо);<br />
                        - виконувати перетворення виразів (розуміти змicтове значення кожного елемента виразу, знаходити допустимі значення змінних, знаходити числові значення виразів при заданих значеннях змінних тощо);<br />
                        - будувати й аналізувати графіки найпростіших функціональних залежностей, досліджувати їxні властивості;<br />
                        - розв'язувати рівняння, нepiвності та їх системи, розв'язувати текстові задачі за допомогою рівнянь, нерівностей та їxнix систем;<br />
                        - знаходити на рисунках геометричні фігури та встановлювати їxнi властивості;<br />
                        - знаходити кiлькicнi характеристики геометричних фiгур (довжини, величини кyтiв, площі, об'єми);<br />
                        - розв'язувати найпростiшi комбiнаторнi задачі та обчислювати ймовiрностi випадкових подій;<br />
                        - аналізувати iнформацiю, що подана в графiчнiй, табличній, текстовій та інших формах.
                        </span>
                        <br /><br />
                    </div>

                    <div class="p-2 bd-highlight" style={{ textAlign: 'center' }}>
                        <b>ЗАГАЛЬНА ХАРАКТЕРИСТИКА СЕРТИФІКАЦІЙНОЇ РОБОТИ З МАТЕМАТИКИ ЗОВНІШНЬОГО НЕЗАЛЕЖНОГО ОЦІНЮВАННЯ {new Date().getFullYear()} РОКУ</b>
                    </div>
                    <br />
                    <div class="p-2 bd-highlight">
                        <span style={{ marginLeft: '20px' }}>
                            Зміст роботи визначено Програмою зовнішнього незалежного оцінювання з
                            математики для осіб, які бажають здобувати вищу освіту на основі повної загальної
                            середньої освіти, затвердженою наказом Міністерства освіти і науки України від
                            03 лютого 2016 року № 77.<br />
                            Загальна кількість завдань роботи – 33.<br />
                            На виконання роботи відведено 180 хвилин.<br />
                            Сертифікаційна робота з математики складається із завдань чотирьох форм: 1.<br />
                            Завдання з вибором однієї правильної відповіді (№ 1–20).<br />
                            Завдання складається з основи та п’яти варіантів відповіді, з яких лише один
                            правильний. Завдання вважається виконаним, якщо учасник зовнішнього незалежного оцінювання вибрав і позначив відповідь у бланку відповідей А.<br />
                            2. Завдання на встановлення відповідності («логічні пари») (№ 21–24).
                            Завдання складається з основи та двох стовпчиків інформації, позначених
                            цифрами (ліворуч) і буквами (праворуч). Виконання завдання передбачає
                            встановлення відповідності (утворення «логічних пар») між інформацією,
                            позначеною цифрами та буквами. Завдання вважається виконаним, якщо учасник
                            зовнішнього незалежного оцінювання зробив позначки на перетинах рядків
                            (цифри від 1 до 4) і колонок (букви від А до Д) у таблиці бланка відповідей А.<br />
                            3. Завдання відкритої форми з короткою відповіддю (№ 25–30):<br />
– структуроване завдання (№ 25, 26) складається з основи та двох частин і
передбачає розв’язування задачі. Завдання вважається виконаним, якщо учасник
зовнішнього незалежного оцінювання, здійснивши відповідні числові розрахунки,
записав, дотримуючись вимог і правил, відповіді до кожної з частин завдання
в бланку відповідей А;<br />
– неструктуроване завдання (№ 27–30) складається з основи та передбачає
розв’язування задачі. Завдання вважається виконаним, якщо учасник
зовнішнього незалежного оцінювання, здійснивши відповідні числові розрахунки,
записав, дотримуючись вимог і правил, кінцеву відповідь у бланку відповідей А.<br />
4. Завдання відкритої форми з розгорнутою відповіддю (№ 31–33).<br />
Завдання складається з основи та передбачає розв’язування задачі. Завдання
вважається виконаним, якщо учасник зовнішнього незалежного оцінювання в
бланку відповідей Б навів пояснення всіх етапів розв’язання, зробив посилання
на математичні факти, з яких випливає те чи інше твердження, проілюстрував
розв’язання задачі рисунками, графіками тощо.<br />
                            <b>Увага!</b><br />
                            <i>Результат виконання завдань № 1–28, 31, 32 буде зараховуватися
                            як результат державної підсумкової атестації
                            за освітній рівень повної загальної середньої освіти для випускників старшої школи
                            загальноосвітніх навчальних закладів 2017 року (за вибором випускника)
                            Результат виконання всіх завдань сертифікаційної роботи буде використовуватися
                            під час прийому до вищих навчальних закладів.</i><br />

                            Схеми нарахування балів за виконання завдань сертифікаційної роботи з математики:<br />
1. Завдання з вибором однієї правильної відповіді оцінюється в 0 або 1 бал:<br />
1 бал, якщо вказано правильну відповідь; 0 балів, якщо вказано неправильну
відповідь, або вказано більше однієї відповіді, або відповіді на завдання не
надано.<br />
2. Завдання на встановлення відповідності («логічні пари») оцінюється в 0, 1,
2, 3 або 4 бали: 1 бал – за кожну правильно встановлену відповідність («логічну
пару»); 0 балів за будь-яку «логічну пару», якщо зроблено більше однієї
позначки в рядку; 0 балів за завдання, якщо не вказано жодної правильної
відповідності («логічної пари»), або відповіді на завдання не надано.<br />
3. Завдання відкритої форми з короткою відповіддю:<br />
– структуроване завдання оцінюється в 0, 1 або 2 бали: 1 бал за кожну правильно
вказану відповідь; 0 балів, якщо вказано обидві неправильні відповіді, або
відповіді на завдання не надано;<br />
– неструктуроване завдання оцінюється в 0 або 2 бали: 2 бали, якщо вказано
правильну відповідь; 0 балів, якщо вказано неправильну відповідь, або відповіді
на завдання не надано.<br />
4. Завдання відкритої форми з розгорнутою відповіддю:<br />
– № 31, 32 оцінюються в 0, 1, 2, 3 або 4 бали;<br />
– № 33 оцінюється в 0, 1, 2, 3, 4, 5 або 6 балів.<br />

                            <b>Увага!</b><br />
                            <i>Розв’язання завдань у чернетці не перевіряються і до уваги не беруться
                            Максимальна кількість балів, яку можна набрати, правильно виконавши всі завдання
                            сертифікаційної роботи з математики, – 62.</i>
                        </span>
                    </div>
                </div>
            </Content>
        </Layout>
    );
};

export default App;